import json
import ollama

model = "phi3:mini"
def analyze_text(text):
    text = text[:5000]
    prompt = f"""
    Ти — професійний бібліотекар та аналітик даних.
    Текст для аналізу:
    ----------------
    {text}
    ----------------

    Твоє завдання — створити метадані для пошукової системи.
    Вимоги до відповіді (JSON):
    1. "description": Короткий опис змісту українською мовою (2-3 речення).
    2. "keywords": Список ключових слів та фраз для пошуку українською.
    ВАЖЛИВО: Не обмежуй кількість тегів. Випиши ВСІ важливі терміни, імена, дати або назви, які зустрічаються в тексті і можуть бути корисні для пошуку. 
    Якщо документ складний — дай більше тегів. Якщо простий — менше.
    ВІДПОВІДАЙ ВИКЛЮЧНО В ТАКОМУ JSON ФОРМАТІ:
    {{
        "description": "Опис документа",
        "keywords": ["слово1", "слово2", "складний термін", "ім'я автора", ...]
    }}
    """
    try:
        response = ollama.chat(model=model, messages=[{"role": "user", "content": prompt}],format='json')
        answer = response.get("message", {}).get("content", "")
        json_answer = answer.replace("```json", "").replace("```", "").strip()
        return json.loads(json_answer)

    except json.JSONDecodeError:
        print("Некоректний формат відповіді AI")
        return {"summary": "Помилка обробки AI.", "keywords": []}
    
    except Exception as e:
        print(f"Помилка обробки: {e}")
        return {"summary": "Помилка обробки.", "keywords": []}
        
text = """Наскільки крутий Phi-3-mini для всіх?
Discussion
Привіт всім! Я тестував Phi-3-mini, нову невелику мовну модель від Microsoft, і я вражений його продуктивністю. Незважаючи на скромні 3 мільярди параметрів, ця модель – справжній монстр, що видає найкращі результати в різних завданнях.

Ефективність Phi-3-mini – це щось неймовірне, вона дозволяє запускати великі мовні моделі локально, не жертвуючи продуктивністю. Його універсальність вражає: він легко справляється з усім – від генерації креативного контенту до розв'язання складних задач.

Розроблений Microsoft та з відкритим кодом під ліцензією MIT, Phi-3-mini – це надійний та доступний варіант для всіх, хто хоче дослідити світ великих мовних моделей.

Хотів би почути ваші думки про Phi-3-mini. Ви вже пробували?
Посилання на Phi-3-mini з контекстним вікном 4K токенів

Посилання на Phi-3-mini з контекстним вікном 128K токенів

Демо HuggingChat

P.S. Опис до посту згенерував Phi-3-mini, але я трохи його підправив.
"""

print(analyze_text(text))
